Revit 2024 API
IFCImportOptions Constructor
 Constructs a new IFCImportOptions using default settings.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IFCImportOptions()
Visual Basic
Public Sub New
Visual C++
public:
IFCImportOptions()
See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace